compositionalDarcyFoam/tests/capillarityGravityEquilibrium/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions                    [1 -1 -2 0 0 0 0];
internalField                 uniform  0.1;
boundaryField
{
    top
    {
        type                          fixedValue;
        value                         $internalField;
    }
    bottom
    {
        type                          fluxPressure;
        value                         $internalField;
    }
    walls
    {
        type                          fluxPressure;
        value                         $internalField;
    }
}


//************************************************************************** //
